[Killed] LogicalOperator
src/app.js:6:5
 // UI wiring (module-safe)
 const btn = document.getElementById('actionBtn');
 const out = document.getElementById('result');
-if (btn && out) {
+if (btn || out) {
   btn.addEventListener('click', () => {
     const value = add(2, 3);
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world

ok 2 Equality > strictEqual and notStrictEqual
ok 3 Equality > deepEqual and notDeepEqual

ok 4 Exceptions > throws

[Killed] ConditionalExpression
src/app.js:6:5
 // UI wiring (module-safe)
 const btn = document.getElementById('actionBtn');
 const out = document.getElementById('result');
-if (btn && out) {
+if (true) {
   btn.addEventListener('click', () => {
     const value = add(2, 3);
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world

ok 2 Equality > strictEqual and notStrictEqual

ok 3 Equality > deepEqual and notDeepEqual

[Killed] BlockStatement
src/app.js:7:39
 const btn = document.getElementById('actionBtn');
 const out = document.getElementById('result');
 if (btn && out) {
-  btn.addEventListener('click', () => {
-    const value = add(2, 3);
-    out.textContent = `2 + 3 = ${value}`;
-  });
+  btn.addEventListener('click', () => {});
 }
 
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world

ok 2 Equality > strictEqual and notStrictEqual

ok 3 Equality > deepEqual and notDeepEqual

[Killed] StringLiteral
src/app.js:7:24
 const btn = document.getElementById('actionBtn');
 const out = document.getElementById('result');
 if (btn && out) {
-  btn.addEventListener('click', () => {
+  btn.addEventListener("", () => {
     const value = add(2, 3);
     out.textContent = `2 + 3 = ${value}`;
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world

ok 2 Equality > strictEqual and notStrictEqual

ok 3 Equality > deepEqual and notDeepEqual

[Killed] StringLiteral
src/app.js:9:23
 if (btn && out) {
   btn.addEventListener('click', () => {
     const value = add(2, 3);
-    out.textContent = `2 + 3 = ${value}`;
+    out.textContent = ``;
   });
 }
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world

ok 2 Equality > strictEqual and notStrictEqual

ok 3 Equality > deepEqual and notDeepEqual

[Killed] ConditionalExpression
src/app.js:14:5
 }
 
 // Expose for QUnit (without polluting global in prod)
-if (typeof window !== 'undefined') {
+if (true) {
   window.__app__ = { add };
 }
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world

ok 2 Equality > strictEqual and notStrictEqual
ok 3 Equality > deepEqual and notDeepEqual

ok 4 Exceptions > throws

[Killed] ConditionalExpression
src/app.js:14:5
 }
 
 // Expose for QUnit (without polluting global in prod)
-if (typeof window !== 'undefined') {
+if (false) {
   window.__app__ = { add };
 }
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world
ok 2 Equality > strictEqual and notStrictEqual
ok 3 Equality > deepEqual and notDeepEqual

ok 4 Exceptions > throws
