[Killed] BlockStatement
src/lib.js:1:27
-export function add(a, b) {
-  return Number(a) + Number(b);
-}
+export function add(a, b) {}
 
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world

ok 2 Equality > strictEqual and notStrictEqual

ok 3 Equality > deepEqual and notDeepEqual

[Killed] ArithmeticOperator
src/lib.js:2:10
 export function add(a, b) {
-  return Number(a) + Number(b);
+  return Number(a) - Number(b);
 }
 
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world

ok 2 Equality > strictEqual and notStrictEqual
ok 3 Equality > deepEqual and notDeepEqual
ok 4 Exceptions > throws
