[Killed] StringLiteral
src/sw.js:2:15
 // Minimal "network-first" with cache fallback
-const CACHE = 'smartlearning-v1'
+const CACHE = ""
 const CORE_ASSETS = ['/', '/index.html', '/styles.css', '/app.js', '/manifest.webmanifest']
 
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world

ok 2 Equality > strictEqual and notStrictEqual

ok 3 Equality > deepEqual and notDeepEqual

[Killed] StringLiteral
src/sw.js:3:57
 // Minimal "network-first" with cache fallback
 const CACHE = 'smartlearning-v1'
-const CORE_ASSETS = ['/', '/index.html', '/styles.css', '/app.js', '/manifest.webmanifest']
+const CORE_ASSETS = ['/', '/index.html', '/styles.css', "", '/manifest.webmanifest']
 
 self.addEventListener('install', (event) => {
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world
ok 2 Equality > strictEqual and notStrictEqual
ok 3 Equality > deepEqual and notDeepEqual

ok 4 Exceptions > throws

[Killed] StringLiteral
src/sw.js:3:42
 // Minimal "network-first" with cache fallback
 const CACHE = 'smartlearning-v1'
-const CORE_ASSETS = ['/', '/index.html', '/styles.css', '/app.js', '/manifest.webmanifest']
+const CORE_ASSETS = ['/', '/index.html', "", '/app.js', '/manifest.webmanifest']
 
 self.addEventListener('install', (event) => {
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world

ok 2 Equality > strictEqual and notStrictEqual

ok 3 Equality > deepEqual and notDeepEqual

[Killed] BlockStatement
src/sw.js:5:45
 const CACHE = 'smartlearning-v1'
 const CORE_ASSETS = ['/', '/index.html', '/styles.css', '/app.js', '/manifest.webmanifest']
 
-self.addEventListener('install', (event) => {
-  event.waitUntil(caches.open(CACHE).then((c) => c.addAll(CORE_ASSETS)))
-})
+self.addEventListener('install', (event) => {})
 
 self.addEventListener('activate', (event) => {
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world
ok 2 Equality > strictEqual and notStrictEqual
ok 3 Equality > deepEqual and notDeepEqual
ok 4 Exceptions > throws
ok 5 Exceptions > doesNotThrow

[Killed] ArrowFunction
src/sw.js:6:43
 const CORE_ASSETS = ['/', '/index.html', '/styles.css', '/app.js', '/manifest.webmanifest']
 
 self.addEventListener('install', (event) => {
-  event.waitUntil(caches.open(CACHE).then((c) => c.addAll(CORE_ASSETS)))
+  event.waitUntil(caches.open(CACHE).then(() => undefined))
 })
 
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world

ok 2 Equality > strictEqual and notStrictEqual

ok 3 Equality > deepEqual and notDeepEqual

[Killed] BlockStatement
src/sw.js:9:46
   event.waitUntil(caches.open(CACHE).then((c) => c.addAll(CORE_ASSETS)))
 })
 
-self.addEventListener('activate', (event) => {
-  event.waitUntil(
-    caches
-      .keys()
-      .then((keys) => Promise.all(keys.filter((k) => k !== CACHE).map((k) => caches.delete(k))))
-  )
-})
+self.addEventListener('activate', (event) => {})
 
 self.addEventListener('fetch', (event) => {
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world
ok 2 Equality > strictEqual and notStrictEqual

ok 3 Equality > deepEqual and notDeepEqual
ok 4 Exceptions > throws

[Killed] ArrowFunction
src/sw.js:13:71
   event.waitUntil(
     caches
       .keys()
-      .then((keys) => Promise.all(keys.filter((k) => k !== CACHE).map((k) => caches.delete(k))))
+      .then((keys) => Promise.all(keys.filter((k) => k !== CACHE).map(() => undefined)))
   )
 })
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world

ok 2 Equality > strictEqual and notStrictEqual

ok 3 Equality > deepEqual and notDeepEqual
ok 4 Exceptions > throws

[Killed] ConditionalExpression
src/sw.js:13:54
   event.waitUntil(
     caches
       .keys()
-      .then((keys) => Promise.all(keys.filter((k) => k !== CACHE).map((k) => caches.delete(k))))
+      .then((keys) => Promise.all(keys.filter((k) => true).map((k) => caches.delete(k))))
   )
 })
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world

ok 2 Equality > strictEqual and notStrictEqual

ok 3 Equality > deepEqual and notDeepEqual

[Killed] BlockStatement
src/sw.js:17:43
   )
 })
 
-self.addEventListener('fetch', (event) => {
-  const { request } = event
-  event.respondWith(
-    fetch(request)
-      .then((res) => {
-        const copy = res.clone()
-        caches.open(CACHE).then((c) => c.put(request, copy))
-        return res
-      })
-      .catch(() => caches.match(request))
-  )
-})
+self.addEventListener('fetch', (event) => {})
 
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world
ok 2 Equality > strictEqual and notStrictEqual
ok 3 Equality > deepEqual and notDeepEqual
ok 4 Exceptions > throws
ok 5 Exceptions > doesNotThrow

[Killed] BlockStatement
src/sw.js:21:22
   const { request } = event
   event.respondWith(
     fetch(request)
-      .then((res) => {
-        const copy = res.clone()
-        caches.open(CACHE).then((c) => c.put(request, copy))
-        return res
-      })
+      .then((res) => {})
       .catch(() => caches.match(request))
   )
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world

ok 2 Equality > strictEqual and notStrictEqual

ok 3 Equality > deepEqual and notDeepEqual

[Killed] ArrowFunction
src/sw.js:23:33
     fetch(request)
       .then((res) => {
         const copy = res.clone()
-        caches.open(CACHE).then((c) => c.put(request, copy))
+        caches.open(CACHE).then(() => undefined)
         return res
       })
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world
ok 2 Equality > strictEqual and notStrictEqual

ok 3 Equality > deepEqual and notDeepEqual

ok 4 Exceptions > throws

[Killed] ArrowFunction
src/sw.js:26:14
         caches.open(CACHE).then((c) => c.put(request, copy))
         return res
       })
-      .catch(() => caches.match(request))
+      .catch(() => undefined)
   )
 })
killedBy: All tests
statusReason: TAP version 13

ok 1 hello world

ok 2 Equality > strictEqual and notStrictEqual

ok 3 Equality > deepEqual and notDeepEqual
